app/Models/KomikModel.php

SELECT *
FROM `komik`
SELECT *
FROM `komik`
WHERE `slug` = 'tokyo-revengers'
 LIMIT 1
---
 public function getKomik ($slug = false){

    if ($slug == false){
        return $this->findAll();
    }

    return $this ->where(['slug' => $slug])->first();